tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/services"
tap "homebrew/cask-fonts"
tap "koekeishiya/formulae"
tap "felixkratz/formulae"
tap "leoafarias/fvm"

# 终端下载AppStore应用
brew "mas"
mas "Xcode", id: 497799835

# nushell
brew "nushell"
# sehll提示以及美化
brew "starship"
# 雄心勃勃的 Vim-fork 专注于可扩展性和敏捷性
brew "neovim"
# 平铺窗口管理器
brew "koekeishiya/formulae/yabai"
# 快捷键管理工具
brew "koekeishiya/formulae/skhd"
# 额外的状态栏
brew "felixkratz/formulae/sketchybar"
# 编写的超快终端文件管理器
brew "yazi"
# ls 命令升级
brew lsd
# 简单、快速和用户友好的替代方案
brew "fd"
# node 包管理器 
brew "mise"
# 用 Go 编写的命令行模糊查找器
brew "fzf"
# 轻量级灵活的命令行 JSON 处理器
brew "jq"
# 用于 git 命令的简单终端 UI
brew "lazygit"
# 终端 docker gui工具
brew "lazydocker"
# 搜索工具，如 grep 和 The Silver Searcher
brew "ripgrep"
# 文件替换工具
brew "gnu-sed"
# ls 增强
brew "lsd"
# 可插拔终端工作区，以终端复用器为基本功能
brew "zellij"
# 网络流量监控工具
brew "ifstat"
# 管理flutter版本工具
brew "leoafarias/fvm/fvm"

# 字体
cask "font-xpinecursive-code"

# 网络代理软件
cask "sfm"
# 浏览器
cask "arc"
# visual-studio-code
cask "visual-studio-code"
# 开关统一管理
cask "only-switch"
# 用于文本翻译和识别的软件
cask "easydict"
# 终端模拟器
cask "kitty"
# 文件管理器
cask "qspace-pro"
# 远程桌面
cask "rustdesk"
# 音视频播放器
cask "iina"
# 柠檬清理
cask "tencent-lemon"
# Plug-in productivity tool set
cask "utools"
# 微信
cask "wechat"
# 企业微信
cask "wechatwork"
# 截图 
cask "pixpin"
